#!/usr/bin/env python
"""
该模块用来定义系统的菜单模板
"""
# 主程序中的主菜单

index_default_menu = '''
-------------------------------------------------------------------------
                             ATM 模拟程序

{0} {1}
-------------------------------------------------------------------------
【1】个人用户                     【2】管理用户                  【3】退出系统 
'''



# 后台管理模板

index_admin = u'''
        ------- ATM ---------
        \033[32;1m1.  添加账户
        2.  删除账户
        3.  信用卡额度
        4.  冻结账户
        5.  退出
        \033[0m'''
# ATM 管理模块
index_ATM = u'''
        ------- ATM ---------
        \033[32;1m1.  账户信息
        2.  还款
        3.  取款
        4.  转账
        5.  账单
        6.  退出
        \033[0m'''

# 显示信用卡基本信息模板
card_info = '''
----------------------------
    信用卡基本信息

\033[32;1m卡号:{id}
开卡日期 :{enroll_date}
有效期 :{expire_date}
信用额度:{credit}  
剩余额度:{balance}
还款日: {pay_day}
状态:{status}\033[0m'''
